import convert from "./number_to_kanji_converter.js";

console.log("start testing converter...");
const testing = [
  ["1", "一"],
  ["2", "二"],
  ["3", "三"],
  ["4", "四"],
  ["5", "五"],
  ["6", "六"],
  ["7", "七"],
  ["8", "八"],
  ["9", "九"],
  ["10", "十"],
  ["11", "十一"],
  ["20", "二十"],
  ["50", "五十"],
  ["100", "百"],
  ["111", "百十一"],
  ["647", "六百四十七"],
  ["999", "九百九十九"],
  ["1000", "千"],
  ["1111", "千百十一"],
  ["8456", "八千四百五十六"],
  ["9999", "九千九百九十九"],
  ["10000", "一万"],
  ["10001", "一万一"],
  ["10010", "一万十"],
  ["10011", "一万十一"],
  ["10100", "一万百"],
  ["10101", "一万百一"],
  ["11000", "一万千"],
  ["11111", "一万千百十一"],
  ["18456", "一万八千四百五十六"],
  ["19999", "一万九千九百九十九"],
  ["20000", "二万"],
  ["99999", "九万九千九百九十九"],
  ["100000", "十万"],
  ["110000", "十一万"],
  ["111111", "十一万千百十一"],
  ["999999", "九十九万九千九百九十九"],
  ["1000000", "百万"],
  ["1111111", "百十一万千百十一"],
  ["9999999", "九百九十九万九千九百九十九"],
  ["10000000", "一千万"],
  ["11111111", "一千百十一万千百十一"],
  ["99999999", "九千九百九十九万九千九百九十九"],
  ["100000000", "一億"],
  ["1000000000000", "一兆"],
  ["1111111111111111", "一千百十一兆一千百十一億一千百十一万千百十一"],
  [
    "9999999999999999",
    "九千九百九十九兆九千九百九十九億九千九百九十九万九千九百九十九"
  ]
];

function assertEqual(expected, result) {
  if (result !== expected) {
    console.error(
      `assert failed:
  expected
    ${expected}
  got:
    ${result}`
    );
  }
}

for (let n of testing) {
  assertEqual(n[1], convert(n[0]));
}
console.log("done!");
